espressif/esp-idf/components/soc/esp32c6/register/soc/pcr_reg.h
/** PCR_SYSCLK_CONF_REG register
 *  SYSCLK configuration register
 */
#define PCR_SYSCLK_CONF_REG (DR_REG_PCR_BASE + 0x110)
/** PCR_LS_DIV_NUM : HRO; bitpos: [7:0]; default: 0;
 *  clk_hproot is div1 of low-speed clock-source if clck-source is a low-speed
 *  clock-source such as XTAL/FOSC.
 */
#define PCR_LS_DIV_NUM    0x000000FFU
#define PCR_LS_DIV_NUM_M  (PCR_LS_DIV_NUM_V << PCR_LS_DIV_NUM_S)
#define PCR_LS_DIV_NUM_V  0x000000FFU
#define PCR_LS_DIV_NUM_S  0
/** PCR_HS_DIV_NUM : HRO; bitpos: [15:8]; default: 2;
 *  clk_hproot is div3 of SPLL if the clock-source is high-speed clock SPLL.
 */
#define PCR_HS_DIV_NUM    0x000000FFU
#define PCR_HS_DIV_NUM_M  (PCR_HS_DIV_NUM_V << PCR_HS_DIV_NUM_S)
#define PCR_HS_DIV_NUM_V  0x000000FFU
#define PCR_HS_DIV_NUM_S  8
/** PCR_SOC_CLK_SEL : R/W; bitpos: [17:16]; default: 0;
 *  This field is used to select clock source. 0: XTAL, 1: SPLL, 2: FOSC, 3: reserved.
 */
#define PCR_SOC_CLK_SEL    0x00000003U
#define PCR_SOC_CLK_SEL_M  (PCR_SOC_CLK_SEL_V << PCR_SOC_CLK_SEL_S)
#define PCR_SOC_CLK_SEL_V  0x00000003U
#define PCR_SOC_CLK_SEL_S  16
/** PCR_CLK_XTAL_FREQ : RO; bitpos: [30:24]; default: 40;
 *  This field indicates the frequency(MHz) of XTAL.
 */
#define PCR_CLK_XTAL_FREQ    0x0000007FU
#define PCR_CLK_XTAL_FREQ_M  (PCR_CLK_XTAL_FREQ_V << PCR_CLK_XTAL_FREQ_S)
#define PCR_CLK_XTAL_FREQ_V  0x0000007FU
#define PCR_CLK_XTAL_FREQ_S  24

/** PCR_CPU_WAITI_CONF_REG register
 *  CPU_WAITI configuration register
 */
#define PCR_CPU_WAITI_CONF_REG (DR_REG_PCR_BASE + 0x114)
/** PCR_CPUPERIOD_SEL : HRO; bitpos: [1:0]; default: 1;
 *  Reserved. This filed has been replaced by PCR_CPU_HS_DIV_NUM and PCR_CPU_LS_DIV_NUM
 */
#define PCR_CPUPERIOD_SEL    0x00000003U
#define PCR_CPUPERIOD_SEL_M  (PCR_CPUPERIOD_SEL_V << PCR_CPUPERIOD_SEL_S)
#define PCR_CPUPERIOD_SEL_V  0x00000003U
#define PCR_CPUPERIOD_SEL_S  0
/** PCR_PLL_FREQ_SEL : HRO; bitpos: [2]; default: 1;
 *  Reserved. This filed has been replaced by PCR_CPU_HS_DIV_NUM and PCR_CPU_LS_DIV_NUM
 */
#define PCR_PLL_FREQ_SEL    (BIT(2))
#define PCR_PLL_FREQ_SEL_M  (PCR_PLL_FREQ_SEL_V << PCR_PLL_FREQ_SEL_S)
#define PCR_PLL_FREQ_SEL_V  0x00000001U
#define PCR_PLL_FREQ_SEL_S  2
/** PCR_CPU_WAIT_MODE_FORCE_ON : R/W; bitpos: [3]; default: 1;
 *  Set 1 to force cpu_waiti_clk enable.
 */
#define PCR_CPU_WAIT_MODE_FORCE_ON    (BIT(3))
#define PCR_CPU_WAIT_MODE_FORCE_ON_M  (PCR_CPU_WAIT_MODE_FORCE_ON_V << PCR_CPU_WAIT_MODE_FORCE_ON_S)
#define PCR_CPU_WAIT_MODE_FORCE_ON_V  0x00000001U
#define PCR_CPU_WAIT_MODE_FORCE_ON_S  3
/** PCR_CPU_WAITI_DELAY_NUM : R/W; bitpos: [7:4]; default: 0;
 *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
 *  will close
 */
#define PCR_CPU_WAITI_DELAY_NUM    0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_M  (PCR_CPU_WAITI_DELAY_NUM_V << PCR_CPU_WAITI_DELAY_NUM_S)
#define PCR_CPU_WAITI_DELAY_NUM_V  0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_S  4

/** PCR_CPU_FREQ_CONF_REG register
 *  CPU_FREQ configuration register
 */
#define PCR_CPU_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x118)
/** PCR_CPU_LS_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set as one within (0,1,3) to generate clk_cpu driven by clk_hproot. The clk_cpu is
 *  div1(default)/div2/div4 of clk_hproot. This field is only available for low-speed
 *  clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_LS_DIV_NUM.
 */
#define PCR_CPU_LS_DIV_NUM    0x000000FFU
#define PCR_CPU_LS_DIV_NUM_M  (PCR_CPU_LS_DIV_NUM_V << PCR_CPU_LS_DIV_NUM_S)
#define PCR_CPU_LS_DIV_NUM_V  0x000000FFU
#define PCR_CPU_LS_DIV_NUM_S  0
/** PCR_CPU_HS_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  Set as one within (0,1,3) to generate clk_cpu driven by clk_hproot. The clk_cpu is
 *  div1(default)/div2/div4 of clk_hproot. This field is only available for high-speed
 *  clock-source such as SPLL, and should be used together with PCR_AHB_HS_DIV_NUM.
 */
#define PCR_CPU_HS_DIV_NUM    0x000000FFU
#define PCR_CPU_HS_DIV_NUM_M  (PCR_CPU_HS_DIV_NUM_V << PCR_CPU_HS_DIV_NUM_S)
#define PCR_CPU_HS_DIV_NUM_V  0x000000FFU
#define PCR_CPU_HS_DIV_NUM_S  8
/** PCR_CPU_HS_120M_FORCE : R/W; bitpos: [16]; default: 0;
 *  Given that PCR_CPU_HS_DIV_NUM is 0, set this field as 1 to force clk_cpu at 120MHz.
 *  Only available when PCR_CPU_HS_DIV_NUM is 0 and clk_cpu is driven by SPLL.
 */
#define PCR_CPU_HS_120M_FORCE    (BIT(16))
#define PCR_CPU_HS_120M_FORCE_M  (PCR_CPU_HS_120M_FORCE_V << PCR_CPU_HS_120M_FORCE_S)
#define PCR_CPU_HS_120M_FORCE_V  0x00000001U
#define PCR_CPU_HS_120M_FORCE_S  16

/** PCR_AHB_FREQ_CONF_REG register
 *  AHB_FREQ configuration register
 */
#define PCR_AHB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x11c)
/** PCR_AHB_LS_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set as one within (0,1,3,7) to generate clk_ahb driven by clk_hproot. The clk_ahb
 *  is div1(default)/div2/div4/div8 of clk_hproot. This field is only available for
 *  low-speed clock-source such as XTAL/FOSC, and should be used together with
 *  PCR_CPU_LS_DIV_NUM.
 */
#define PCR_AHB_LS_DIV_NUM    0x000000FFU
#define PCR_AHB_LS_DIV_NUM_M  (PCR_AHB_LS_DIV_NUM_V << PCR_AHB_LS_DIV_NUM_S)
#define PCR_AHB_LS_DIV_NUM_V  0x000000FFU
#define PCR_AHB_LS_DIV_NUM_S  0
/** PCR_AHB_HS_DIV_NUM : R/W; bitpos: [15:8]; default: 3;
 *  Set as one within (3,7,15) to generate clk_ahb driven by clk_hproot. The clk_ahb is
 *  div4(default)/div8/div16 of clk_hproot. This field is only available for high-speed
 *  clock-source such as SPLL, and should be used together with PCR_CPU_HS_DIV_NUM.
 */
#define PCR_AHB_HS_DIV_NUM    0x000000FFU
#define PCR_AHB_HS_DIV_NUM_M  (PCR_AHB_HS_DIV_NUM_V << PCR_AHB_HS_DIV_NUM_S)
#define PCR_AHB_HS_DIV_NUM_V  0x000000FFU
#define PCR_AHB_HS_DIV_NUM_S  8

/** PCR_APB_FREQ_CONF_REG register
 *  APB_FREQ configuration register
 */
#define PCR_APB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x120)
/** PCR_APB_DECREASE_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be
 *  automatically down to clk_apb_decrease only when no access is on apb-bus, and will
 *  recover to the previous frequency when a new access appears on apb-bus. Set as one
 *  within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note
 *  that enable this function will reduce performance. Users can set this field as zero
 *  to disable the auto-decrease-apb-freq function. By default, this function is
 *  disable.
 */
#define PCR_APB_DECREASE_DIV_NUM    0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_M  (PCR_APB_DECREASE_DIV_NUM_V << PCR_APB_DECREASE_DIV_NUM_S)
#define PCR_APB_DECREASE_DIV_NUM_V  0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_S  0
/** PCR_APB_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  Set as one within (0,1,3) to generate clk_apb driven by clk_ahb. The clk_apb is
 *  div1(default)/div2/div4 of clk_ahb.
 */
#define PCR_APB_DIV_NUM    0x000000FFU
#define PCR_APB_DIV_NUM_M  (PCR_APB_DIV_NUM_V << PCR_APB_DIV_NUM_S)
#define PCR_APB_DIV_NUM_V  0x000000FFU
#define PCR_APB_DIV_NUM_S  8

